Repository: AfoHT/rpncalc
Catalog: po/*.po
Languages: de, es, fi, fr

source: defined only for arguments >= 0.
de: Nur für Argumente >= 0 definiert
es: definido sólo para argumentos >= 0.
fi: määritelty vain argumenteille >= 0.
fr: uniquement défini pour les arguments positifs.

source: `%s' is a function
de: `%s' ist eine Funktion
es: `%s' es una función
fi: '%s' on funktio
fr: « %s » est une fonction

source: `%s' is a command
de: `%s' ist ein Befehl
es: `%s' es un comando
fi: '%s' on komento
fr: « %s » est une commande

source: and takes 1 argument
de: und verlangt 1 Argument
es: y debe tener 1 argumento
fi: ja ottaa yhden argumentin
fr: et prend 1 argument

source: and takes %d arguments
de: und verlangt %d Argumente
es: y tiene %d argumentos
fi: ja ottaa %d argumenttia
fr: et prend %d arguments

source: The following operations and constants are recognized:
de: Folgende Operatoren und Konstanten sind bekannt:
es: Se reconocen las siguientes operaciones y constantes:
fi: Seuraavat operaatiot ja vakiot tunnetaan:
fr: Les opérations et constantes suivantes sont reconnues :

source: Delimiters are ',', ';', space, tab, and newline.
de: Gültige Trenner sind ',', ';', Leerzeichen, Tabulator, und Newline.
es: Los delimitadores son ',', ';', espacio, tabulador y el caracter de cambio de línea.
fi: Erottimia ovat ',', ';', välilyönti, sarkain ja rivinvaihto.
fr: Les séparateurs sont « , », « ; », espace, tabulation, et retour à la ligne.

source: undefined variable
de: nicht definierte Variable
es: variable sin definir
fi: määrittelemätön muuttuja
fr: variable non définie

source: is a constant
es: es una constante
fi: on vakio
fr: est une constante

source: variable table is full
es: la tabla de variables está llena
fi: muuttujataulu on täynnä
fr: la table des variables est pleine

source: usage: %s [-h][-v] ["expression"]
es: Modo de empleo: %s [-h][-v] [\"expresión\"]
fi: käyttö: %s [-h] [-v] ["lauseke"]

source: display this help and exit
de: zeigt diese Hilfestellung und beendet das Programm
es: escribe esta ayuda y finaliza
fi: näytä tämä avuste ja lopeta
fr: afficher cette aide

source: output version information and exit
de: gibt die Versionsnummer aus und beendet das Programm
es: escribe información sobre la versión y acaba
fi: tulosta versiotiedot ja lopeta
fr: afficher les informations sur la version

source: show license information and exit
de: zeigt die Lizenzinformation und beendet das Programm
es: muestra información sobre la licencia y acaba
fi: näytä lisenssitiedot ja lopeta
fr: afficher les informations sur la licence

source: %s version %s
es: %s versión %s
fi: %s versio %s

source: This is free software with ABSOLUTELY NO WARRANTY.
de: Dies ist Freie Software ohne JEGLICHE GARANTIE.
es: Este software es libre y viene ABSOLUTAMENTE SIN GARANTÍA.
fi: Tämä on vapaa ohjelma ILMAN MINKÄÄNLAISTA TAKUUTA.
fr: Il s'agit d'un logiciel libre SANS AUCUNE GARANTIE.

source: For details, type `warranty'.
de: Für Details, tippen Sie bitte `warranty'.
es: Para más detalles, escriba `warranty'.
fi: Lisätietoa saat kirjoittamalla 'warranty'.
fr: Pour de plus amples informations, tapez « warranty ».

source: Type `quit' to quit and `?' to get a summary.
de: Tippen Sie `quit' um rpncalc zu beenden und `?' um Hilfe zu erhalten.
es: Escriba `quit' para acabar y `?' para un sumario.
fi: Kirjoita 'quit' lopettaaksesi. Kirjoittamalla '?' saat yhteenvedon.
fr: Tapez « quit » pour quitter ou « ? » pour obtenir de l'aide.

source: invalid hexadecimal constant
de: ungültige Hexadezimalzahl
es: constante hexadecial no válida
fi: huono heksadesimaalilukuvakio
fr: constante hexadécimale invalide

source: invalid binary constant
fi: huono binäärilukuvakio
fr: constante binaire invalide

source: invalid octal constant
de: ungültige Octalzahl
es: constante octal no válida
fi: huono oktaalilukuvakio
fr: constante octale invalide

source: invalid integer constant
de: ungültige Ganzzahl
es: constante entera no válida
fi: huono kokonaislukuvakio
fr: constante entière invalide

source: undefined function or command
de: undefinierter Befehl oder undefinierte Funktion
es: función o orden no definida
fi: määrittelemätön funktio tai komento
fr: fonction ou commande non définie

source: %s:%s:%d: %s at '%s'
de: %s:%s:%d: %s bei '%s'
es: %s:%s:%d: %s en '%s'
fi: %s:%s:%d: %s kohdassa '%s'
fr: %s:%s:%d : %s à « %s »

source: pop: stack empty.
de: pop: leerer Stack.
es: pop: pila vacía.
fi: pop: pino on tyhjä.
fr: pop : pile vide.

source: pick: element not available.
de: pick: Element nicht verfügbar.
es: pick: no existe el elemento.
fi: pick: alkiota ei ole saatavilla.
fr: pick : élément indisponible.

source: drop: stack empty.
de: drop: leerer Stack.
es: drop: pila vacía.
fi: drop: pino on tyhjä.
fr: drop : pile vide.

source: Out of memory!
de: Kein Speicher mehr frei!
es: ¡ Memoria agotada!
fi: Muisti loppu!
fr: Mémoire pleine !
